        anomalies: "ブリー, ノックアウト, 最後のチャンス, シュリーマの遺産"
      },
      {
        name: "ステブ(ヒーロー)",
        items: "ヒーロー:, ブラッドサースター, アークエンジェルスタッフ, 巨人の誓い, ジュエルガントレット",
        anomalies: "究極のヒーロー, ブリー"
      },
      {
        name: "スウェイン",
        items:
          "CARRY: ショウジンの矛, ガードブレーカー, ジュエルガントレット ... , タンク: ガーゴイル ストーンプレート, ワーモグアーマー, リデンプション, プロテクターの誓い, アイオニックスパーク or イーブンシュラウド, サンファイアケープ, DC, ブランブルベスト",
        anomalies:
          "ブリー, 無駄なし, 連続キル, 逆転劇, フィニッシャー, 魔法の訓練, フリースタイル"
      },
      {
        name: "トリスターナ",
        items: "グインソーレイジブレード, インフィニティエッジ, ジャイアントスレイヤー, デスブレード, ラストウィスパー",
        anomalies:
          "ブリー, 鷹の目, 巨人の攻撃, 腕力の訓練, 逆転劇"
      },
      {
        name: "トランドル (ヒーロー)",
        items: "ヒーロー:, ブラッドサースター, 巨人の誓い, ハンド オブ ジャスティス, クイックシルバー",
        anomalies: "究極のヒーロー, ブリー, シュリーマの遺産"
      },
      {
        name: "ツイステッド・フェイト",
        items:
          "ショウジンの矛,ナッシャートゥース, ジュエルガントレット, アークエンジェルスタッフ, モレロノミコン, ラバドンデスキャップ, ジャイアントスレイヤー",
        anomalies: "ブリー, 超高速, 逆転劇, ドラゴンソウル"
      },
      {
        name: "トゥイッチ",
        items:
          "グインソーレイジブレード, インフィニティエッジ, レッドバフ, ラストウィスパー, ルナーンハリケーン, デスブレード, ジャイアントスレイヤー, ガードブレーカー",
        anomalies:
          "ドラゴンソウル, 鷹の目, 巨人の攻撃, 腕力の訓練, 逆転劇, ミニ・ミー, 狼の使い魔"
      },
      {
        name: "アーゴット",
        items: "ブラッドサースター or ハンド オブ ジャスティス, 巨人の誓い, ステラックの篭手, インフィニティエッジ",
        anomalies:
          "要塞化, ブルワーク, 超特大サイズ, 攻撃の達人, フリースタイル, 巨人の攻撃, 逆転劇, 力への飢え (Urgot+Sett Comp), ブリー"
      },
      {
        name: "ヴァンダ(ヒーロー)",
        items:
          "ヒーロー:, ブラッドサースター, 巨人の誓い, ハンド オブ ジャスティス, ステラックの篭手 ... , タンク: ガーゴイル ストーンプレート, ワーモグアーマー, リデンプション, プロテクターの誓い",
        anomalies: "ヒーロー:, ブリー, 友情の力, 破竹の勢い"
      },
      {
        name: "ヴェックス",
        items:
          "ショウジンの矛, ジュエルガントレット, ナッシャートゥース, ラバドンデスキャップ, アークエンジェルスタッフ, ジャイアントスレイヤー",
        anomalies:
          "ブリー, 無駄なし, 連続キル, 逆転劇, フィニッシャー, 魔法の訓練, フリースタイル"
      },
      {
        name: "ヴァイ",
        items:
          "ブラッドサースター or ハンド オブ ジャスティス, 巨人の誓い, ステラックの篭手, ナイトエッジ, クイックシルバー, インフィニティエッジ",
        anomalies: "逆転劇, 最後のチャンス"
      },
      {
        name: "ビクター",
        items:
          "Thief's Gloves, レッドバフ or モレロノミコンs, ラバドンデスキャップ, ジャイアントスレイヤー, デスブレード, ジュエルガントレット, ホライゾン フォーカス",
        anomalies: "逆転劇, 魔法の達人"
      },
      {
        name: "ヴァイオレット",
        items:
          "ブラッドサースター or ハンド オブ ジャスティス, 巨人の誓い, ステラックの篭手, ナイトエッジ, クイックシルバー, インフィニティエッジ, 伏兵の紋章",
        anomalies: "究極のヒーロー, ブリー, 最後のチャンス, 友情の力"
      },
      {
        name: " ブラッドミア(ヒーロー)",
        items: "ヒーロー:, グインソーレイジブレード, アークエンジェルスタッフ, ジュエルガントレット",
        anomalies:
          "ブリー, 無駄なし, 連続キル, 逆転劇, 魔法の達人"
      },
      {
        name: "ワーウィック",
        items:
          "アートマターの紋章, ナイトエッジ, ブラッドサースター or ハンド オブ ジャスティス, ステラックの篭手, 巨人の誓い",
        anomalies: "腕力の訓練, 逆転劇, 巨人の攻撃"
      },
      {
        name: "ゼリ",
        items:
          "グインソーレイジブレード, インフィニティエッジ, ラストウィスパー, レッドバフ, デスブレード, ジャイアントスレイヤー, フィッシュボーン",
        anomalies:
          "ブリー, 巨人の攻撃, 腕力の訓練, フィニッシャー, 逆転劇"
      },
      {
        name: "ジグス",
        items:
          "ショウジンの矛, ジュエルガントレット, ナッシャートゥース, ラバドンデスキャップ, アークエンジェルスタッフ, モレロノミコン or レッドバフ",
        anomalies:
          "ブリー, 無駄なし, 連続キル, 逆転劇, フィニッシャー, 魔法の訓練, フリースタイル, 魔法の達人"
      },
      {
        name: "ゾーイ",
        items:
          "ショウジンの矛, ジュエルガントレット, ナッシャートゥース, ラバドンデスキャップ, アークエンジェルスタッフ, モレロノミコン or レッドバフ, ジャイアントスレイヤー, ガードブレーカー",
        anomalies:
          "無駄なし, 連続キル, 逆転劇, フィニッシャー, 魔法の訓練, フリースタイル, エネルギー吸収"
      },
      {
        name: "ザイラ",
        items: "ショウジンの矛, ジュエルガントレット, ナッシャートゥース, ラバドンデスキャップ, アークエンジェルスタッフ",
        anomalies:
          "ブリー, 無駄なし, 連続キル, 逆転劇, フィニッシャー, 魔法の訓練, フリースタイル"
      }
    
    
];

const buttonsContainer = document.getElementById("character-buttons");
const characterName = document.getElementById("character-name");
const characterItems = document.getElementById("character-items");
const characterAnomalies = document.getElementById("character-anomalies");

characters.forEach(character => {
    const button = document.createElement("button");
    button.className = "button";
    button.textContent = character.name;
    button.onclick = () => {
        characterName.textContent = character.name;
        
        // アイテム部分に改行を追加
        characterItems.innerHTML = `<strong>アノマリー:</strong><br>${character.items
            .split(', ')  // アノマリーをカンマで分割
            .map(items => `・ ${items}`)  // それぞれのアノマリーに「・」をつける
            .join('<br>')}`;  // 改行でつなげる
        // アノマリー部分に「・」と改行を追加
        characterAnomalies.innerHTML = `<strong>アノマリー:</strong><br>${character.anomalies
            .split(', ')  // アノマリーをカンマで分割
            .map(anomaly => `・ ${anomaly}`)  // それぞれのアノマリーに「・」をつける
            .join('<br>')}`;  // 改行でつなげる
    };
    buttonsContainer.appendChild(button);
});
